# IFCGeometryInfo Properties

---
The IFCGeometryInfo type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
IFCGeometryInfo Class
Autodesk.Revit.DB.IFC Namespace